leocadpin/Drivers-for-stm32f407xx/drivers/Inc/stm32f4xx_usart_drivers.h
/*
 * stm32f4xx_usart_drivers.h
 *
 *  Created on: Apr 19, 2024
 *      Author: leo
 */

#ifndef INC_STM32F4XX_USART_DRIVERS_H_
#define INC_STM32F4XX_USART_DRIVERS_H_

#include "stm32f407xx.h"
#include "stddef.h"
#include "stm32f4xx_rcc_driver.h"
/*
 * Configuration structure for USART
 */
typedef struct
{
	uint8_t USART_Mode;
	uint32_t USART_Baud;
	uint8_t USART_nb_stp_bits;
	uint8_t USART_wrd_length;
	uint8_t USART_parity_control;
	uint8_t USART_hw_flow_control;
}USART_Config_t;

/*
 * Handle structure for USART peripheral
 */
typedef struct
{
	USART_RegDef_t *pUSARTx;
	USART_Config_t USART_Config;
	uint8_t *pTxBuffer;
	uint8_t *pRxBuffer;
	uint32_t TxLen;
	uint32_t RxLen;
	uint8_t TxBusyState;
	uint8_t RxBusyState;
}USART_Handle_t;


/*
 * Init and deinit
 */
void USART_Init(USART_Handle_t *pUSARTHandle);
void USART_Deinit(USART_RegDef_t *pUSARTx);

/*
 * Peripheral clock related functions
 */

void USART_PeriClockControl(USART_RegDef_t *pUSARTx, uint8_t en_or_di);
void USART_PeripheralControl(USART_RegDef_t *pUSARTx, uint8_t en_or_di);

/*
 * Set baudrate
 */
void USART_SetBaudRate(USART_RegDef_t *pUSARTx, uint32_t BaudRate);

/*
 * Flag functions
 */

uint8_t USART_Get_Flag_status(USART_RegDef_t *pUSARTx, uint8_t status_flag_name);
void USART_Clear_Flag(USART_RegDef_t *pUSARTx, uint16_t status_flag_name);

/*
 * Interrupt related functions
 */
void USART_IRQ_interrupt_config(uint8_t IRQ_number, uint8_t en_or_di);
void USART_IRQ_priority_config(uint8_t IRQ_number, uint32_t en_or_di);
void USART_IRQHandling(USART_Handle_t *pUSARTHandle);
/*
 * Application callback
 */
void USART_ApplicationEventCallback(USART_Handle_t *pUSARTHandle,uint8_t AppEv);

/*
 * @USART_Parity_Control
 */
#define USART_PARITY_EN_ODD  	 2
#define USART_PARITY_EN_EVEN 	 1
#define USART_PARITY_EN_DISABLE  0

/*
 * @USART Word_length
 */
#define USART_WORDLEN_8BITS  0
#define USART_WORDLEN_9BITS  1

/*
 * @USAR_NB_STOP_BITS
 */
#define USART_STOPBITS_1 	0
#define USART_STOPBITS_0_5 	1
#define USART_STOPBITS_2 	2
#define USART_STOPBITS_1_5 	3

/*
 * @USART_hw_flow_control
 */
#define USART_HW_FLOW_CTRL_NONE		0
#define USART_HW_FLOW_CTRL_CTS		1
#define USART_HW_FLOW_CTRL_RTS		2
#define USART_HW_FLOW_CTRL_CTS_RTS	3

/*
 * @USART_Mode
 */
#define USART_MODE_ONLY_TX		0
#define USART_MODE_ONLY_RX		1
#define USART_MODE_TXRX			2

/*
 * @USART_Baud
 */
#define USART_STD_BAUD_1200			1200
#define USART_STD_BAUD_2400			2400
#define USART_STD_BAUD_9600			9600
#define USART_STD_BAUD_19200		19200
#define USART_STD_BAUD_38400		38400
#define USART_STD_BAUD_57600		57600
#define USART_STD_BAUD_115200		115200
#define USART_STD_BAUD_115200		115200
#define USART_STD_BAUD_230400		230400
#define USART_STD_BAUD_460800		460800
#define USART_STD_BAUD_921600		921600
#define USART_STD_BAUD_2M			2000000
#define USART_STD_BAUD_3M			3000000


/*
 *	USART related status flags definitions
 */
#define USART_FLAG_PE			( 1 << USART_SR_PE )
#define USART_FLAG_FE			( 1 << USART_SR_FE )
#define USART_FLAG_NF			( 1 << USART_SR_NF )
#define USART_FLAG_ORE			( 1 << USART_SR_ORE )
#define USART_FLAG_IDLE			( 1 << USART_SR_IDLE )
#define USART_FLAG_RXNE			( 1 << USART_SR_RXNE )
#define USART_FLAG_TC			( 1 << USART_SR_TC )
#define USART_FLAG_TXE			( 1 << USART_SR_TXE )
#define USART_FLAG_LBD			( 1 << USART_SR_LBD )
#define USART_FLAG_CTS			( 1 << USART_SR_CTS )

/*
 *	Possible USART application states
 */
#define USART_READY				0
#define USART_BUSY_IN_RX		1
#define USART_BUSY_IN_TX		2

/*
 *  USART application events macros
 */
#define 	USART_EVENT_TX_CMPLT	0
#define		USART_EVENT_RX_CMPLT	1
#define		USART_EVENT_IDLE		2
#define		USART_EVENT_CTS			3
#define		USART_EVENT_PE			4
#define		USART_ERROR_FE			5
#define		USART_ERROR_NE			6
#define		USART_ERROR_ORE			7

#endif /* INC_STM32F4XX_USART_DRIVERS_H_ */
